tutorials/plastic_cases/hele_shaw_fracturing/U3nu1.4e-4STD0.1Trial2Case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     plasticHBIF;

startFrom       latestTime;

startTime       0;

stopAt          //writeNow;
		endTime;

endTime         150;

deltaT          1e-7;

writeControl    adjustableRunTime; //timeStep

writeInterval   2.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;
maxCoUs		0.25;
maxAlphaCo      0.25;
maxDeltaT       0.05;

// ************************************************************************* //
